Revit 2027 API
ControlledApplication.Product Property
 The product type for the current session of Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ProductType Product { get; }
Public ReadOnly Property Product As ProductType
	Get
public:
property ProductType Product {
	ProductType get ();
}
member Product : ProductType with get
Property Value
ProductType
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace